Revit 2018 API
BasicFileInfo.SavedInVersion Property
 Returns the version in which file is saved.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 18.0.0.0 (18.0.0.0)
Since: 2013
Syntax
C#
public string SavedInVersion { get; }
Visual Basic
Public ReadOnly Property SavedInVersion As String
	Get
Visual C++
public:
property String^ SavedInVersion {
	String^ get ();
}
See Also
BasicFileInfo Class
Autodesk.Revit.DB Namespace